using System.Runtime.InteropServices;

namespace Swift_Delivery;

public class Система
{
    Dictionary<Потребител, List<Поръчка>> поръчки;
    int i = 1; //номер на поръчки

    public Система()
    {
        поръчки = new();
    }

    public void ДобавиПратка(Пратка пратка, Потребител потребител)
    {
        if(!поръчки.ContainsKey(потребител))
            поръчки.Add(потребител, new());

        поръчки[потребител].Add(new Поръчка(пратка, i.ToString()));
        i++;
    }

    public (Потребител, int) НамериПоръчка(string търсенНомер)
    {
        foreach(var потребител in поръчки)
            foreach(Поръчка поръчка in потребител.Value)
                if(поръчка.Номер == търсенНомер)
                    return (потребител.Key,потребител.Value.IndexOf(поръчка));
        
        throw new InvalidOperationException("Няма поръчка с този номер!");
    }

    public void АктуализацияНаСтатуса(string номер, СтатусПоръчка статус)
    {
        Потребител потребител;
        int индекс;
        (потребител, индекс) = НамериПоръчка(номер);
        
        поръчки[потребител][индекс].ПромениСтатус(статус);
    }

    public double ОчакванДоход()
    {
        double доход = 0;

        foreach(var потребител in поръчки)
            foreach(Поръчка поръчка in потребител.Value)
                if(поръчка.Статус != СтатусПоръчка.Доставена)
                    доход+=поръчка.Стойност;
        
        return доход;
    }

    public List<Поръчка> НамериВсичкиПоръчкиНа(Потребител потребител)
    {
        if(!поръчки.ContainsKey(потребител))
            throw new InvalidOperationException("Не може да се намери такъв потребител!");
        
        return поръчки[потребител];
    }

    public List<Пратка> НамериВсичкиПратки(Потребител потребител, СтатусПоръчка статус)
    {
        return НамериВсичкиПоръчкиНа(потребител).Where(п=>п.Статус==статус).Select(п=>п.пратка).ToList();
    }

    public double ОбщПриходОт(Потребител потребител)
    {
        if(!поръчки.ContainsKey(потребител))
            throw new InvalidOperationException("Не може да се намери такъв потребител!");

        return поръчки[потребител].Sum(п => п.Стойност);
    }

    public Потребител НамериНайЦененПотребител()
    {
        if(поръчки.Count==0)
            throw new InvalidOperationException("В списъкът няма поръчки!");

        double найГолямаПечалба = -1;
        Потребител ?найЦененПотребител = null;

        foreach(var потребител in поръчки)
            if(ОбщПриходОт(потребител.Key)>=найГолямаПечалба)
                (найГолямаПечалба, найЦененПотребител) = (ОбщПриходОт(потребител.Key), потребител.Key);

        return найЦененПотребител;
    }
}