//#include <iostream>
//using namespace std;
//int main() {
//  system("chcp 1251 > nul");
//  cout << "----- 12345 -----  "
//    << "брой байтове: " << sizeof(12345)
//    << " ; уникално име: " << typeid(12345).name() << endl
//    << "----- 12345u -----  "
//    << "брой байтове: " << sizeof(12345u)
//    << " ; уникално име: " << typeid(12345u).name() << endl
//    << "----- 12345L -----  "
//    << "брой байтове: " << sizeof(12345L)
//    << " ; уникално име: " << typeid(12345L).name() << endl
//    << "----- 12345uL -----  "
//    << "брой байтове: " << sizeof(12345uL)
//    << " ; уникално име: " << typeid(12345uL).name() << endl
//    << "----- 12345LL -----  "
//    << "брой байтове: " << sizeof(12345LL)
//    << " ; уникално име: " << typeid(12345LL).name() << endl
//    << "----- 12345uLL -----  "
//    << "брой байтове: " << sizeof(12345uLL)
//    << " ; уникално име: " << typeid(12345uLL).name() << endl
//    << "----- 12345.f -----  "
//    << "брой байтове: " << sizeof(12345.f)
//    << " ; уникално име: " << typeid(12345.f).name() << endl
//    << "----- 12345. -----  "
//    << "брой байтове: " << sizeof(12345.)
//    << " ; уникално име: " << typeid(12345.).name() << endl
//    << "----- 12345.L -----  "
//    << "брой байтове: " << sizeof(12345.L)
//    << " ; уникално име: " << typeid(12345.L).name() << endl
//    << "----- 1'2'3'4'5 -----  "
//    << "брой байтове: " << sizeof(1'2'3'4'5)
//    << " ; уникално име: " << typeid(1'2'3'4'5).name() << endl
//    << "----- 1'2'3.4'5 -----  "
//    << "брой байтове: " << sizeof(1'2'3.4'5)
//    << " ; уникално име: " << typeid(1'2'3.4'5).name() << endl
//    << "----- 0x1af -----  "
//    << "брой байтове: " << sizeof(0x1af)
//    << " ; уникално име: " << typeid(0x1af).name() << endl
//    << "----- 0x1afLL -----  "
//    << "брой байтове: " << sizeof(0x1afLL)
//    << " ; уникално име: " << typeid(0x1afLL).name() << endl
//    << "----- 0x1ap0f -----  "
//    << "брой байтове: " << sizeof(0x1ap0f)
//    << " ; уникално име: " << typeid(0x1ap0f).name() << endl
//    << "----- 0x1.ap-200L -----  "
//    << "брой байтове: " << sizeof(0x1.ap-200L)
//    << " ; уникално име: " << typeid(0x1.ap-200L).name() << endl
//    << "----- 0b1111LL -----  "
//    << "брой байтове: " << sizeof(0b1111LL)
//    << " ; уникално име: " << typeid(0b1111LL).name() << endl
//    << "----- 'a' -----  "
//    << "брой байтове: " << sizeof('a')
//    << " ; уникално име: " << typeid('a').name() << endl
//    << "----- 'aa' -----  "
//    << "брой байтове: " << sizeof('aa')
//    << " ; уникално име: " << typeid('aa').name() << endl
//    << "----- u'a' -----  "
//    << "брой байтове: " << sizeof(u'a')
//    << " ; уникално име: " << typeid(u'a').name() << endl
//    << "----- U'a' -----  "
//    << "брой байтове: " << sizeof(U'a')
//    << " ; уникално име: " << typeid(U'a').name() << endl
//    << "----- L'a' -----  "
//    << "брой байтове: " << sizeof(L'a')
//    << " ; уникално име: " << typeid(L'a').name() << endl
//    << "----- \"abc\" -----  "
//    << "брой байтове: " << sizeof("abc")
//    << " ; уникално име: " << typeid("abc").name() << endl
//    << "----- \"abc\"s -----  "
//    << "брой байтове: " << sizeof("abc"s)
//    << " ; уникално име: " << typeid("abc"s).name() << endl;
//}